Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType
The type of the GUID to be retrieved from Revit.
Since:
2013

Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType.Site
The site GUID.

Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType.Building
The building GUID.

Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType.Project
The project GUID.